SecurityResearchTools_20C80/usr/local/share/man/man1/srdutil-restore.1
.Dd August 14, 2020
.Dt SRDUTIL-RESTORE 1
.Os Darwin
.Sh NAME
.Nm srdutil restore
.Nd Security Research Device flashing utility
.Sh SYNOPSIS \" Section Header - required - don't modify
.Nm srdutil restore
.Op Fl -stream
.Op Fl -ecid Ar ECID
.Op Fl -ipsw Ar PATH-TO-IPSW
.Op Fl X | Fl -appleconnect
.Sh DESCRIPTION \" Section Header - required - don't modify
.Nm srdutil restore
erase restores the security research iOS variant onto specified devices.
.Pp
This variant will only run on an appropriately fused Security Research Device
.Pq SRD .
If the research variant is restored to a non-SRD, or if a customer variant is
restore to an SRD,
.Sy the device will require a DFU erase install to recover .
.Pp
All restores using
.Nm
are
.Sy erase installs .
.Sh OPTIONS
List of options and their descriptions:
.Bl -tag -width -indent
.It Fl s | Fl -stream
Stream connection events and the ECID of the associated device to
.Xr stdout 4 .
.Pp
This will block until
.Nm
is terminated.
.It Fl e | Fl -ecid Ar ECID
The ECID of the device to restore. This can be obtained using
.Fl -stream
or with the
.Ar list
subcommand of
.Xr cryptexctl-device 1 .
.Nm
will block until a device with the specified
.Ar ECID
appears and the restore is complete.
.Pp
If
.Fl -ecid
is specified, then
.Fl -ipsw
must also be specified to indicate what to restore.
.It Fl i | Fl -ipsw Ar PATH-TO-IPSW
Path to an IPSW to restore to the device specified by
.Fl -ecid .
The research variant will be extracted and erase installed
onto the device.
.It Fl X | Fl -appleconnect
Use AppleConnect authentication for personalization of the restore bundle.
This is mostly useful for Apple internal development.
.El
.Sh SEE ALSO
.Xr cryptexctl 1 ,
.Xr srdutil 1
.Sh HISTORY
Introduced in macOS 11.0
